УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/БЗ_ТехнологическаяОперация/БЗ_ТехнологическаяОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БЗ_ТехнологическаяОперация</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.БЗ_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.БЗ_ВидТехнологическойОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТЕ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрылТЕ</name>
    <type>
      <types>CatalogRef.БЗ_Сотрудники_ТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТСД_Взять</name>
    <attributes>
      <name>ДокументПлан</name>
      <type>
        <types>DocumentRef.БЗ_Резка</types>
        <types>DocumentRef.БЗ_МаршрутныйЛистПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючВзять</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючПоложить</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТЕ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.БЗ_Участки</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.БЗ_РабочиеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.БЗ_ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.БЗ_Сотрудники_ТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДвиженияТСД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТСД_Положить</name>
    <attributes>
      <name>ДокументПлан</name>
      <type>
        <types>DocumentRef.БЗ_Резка</types>
        <types>DocumentRef.БЗ_МаршрутныйЛистПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючВзять</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючПоложить</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТЕ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.БЗ_Участки</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.БЗ_РабочиеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.БЗ_ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.БЗ_Сотрудники_ТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДвиженияТСД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/БЗ_ТехнологическаяОперация/ObjectModule.bsl
Процедура ВзятьРезка()
	БЗ_ОперацияРезка_Материалы = Движения.БЗ_ОперацияРезка_Материалы;
	БЗ_ОперацияРезка_Материалы.Записывать = Истина;
	
	БЗ_СменныеЗадания = Движения.БЗ_СменныеЗадания;
	БЗ_СменныеЗадания.Записывать = Истина;
	
	ТЗ_Взять = ПолучитьСводнуюТЗВзятьРезка();

	Для Каждого ТСтрока Из ТЗ_Взять Цикл        // Резка материалы
		Если ТСтрока.Кратность>0  Тогда
			Отбор = Новый Структура ("КлючСхемы, Операция, Статус", ТСтрока.КлючВзять, ТСтрока.Операция, Перечисления.БЗ_СтатусыОстатковНаУчастке.План);
			Резка_Материалы_Остатки = РегистрыНакопления.БЗ_ОперацияРезка_Материалы.Остатки(ТСтрока.ВремяОперации, Отбор, ,"Количество");
			КоличествоЗавершено = ТСтрока.Кратность;
			Для Каждого СтрокаОстатка из Резка_Материалы_Остатки Цикл
				Если КоличествоЗавершено <=0 Тогда
					Прервать;
				КонецЕсли;
				МожноСписать = Макс (Мин(СтрокаОстатка.Количество, КоличествоЗавершено),0);
				Движение=БЗ_ОперацияРезка_Материалы.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
				Движение.Активность=Истина;		
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Период=ТСтрока.ВремяОперации;
				Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.План;
				ФайлСхемыРезки = Движение.ФайлСхемыРезки;
				Движение.Количество= КоличествоЗавершено; //Сколько листов в пачке за операцию
				КоличествоЗавершено = КоличествоЗавершено - МожноСписать;
			КонецЦикла;	
		КонецЕсли;
		Если ТСтрока.КратностьВРаботе>0  Тогда
			//В работе
			Движение=БЗ_ОперацияРезка_Материалы.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Приход;		
			Движение.Активность=Истина;		
			Движение.Период=Дата;
			Движение.КлючСхемы=ТСтрока.КлючСхемы;	
			Движение.Номенклатура= ТСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры= ТСтрока.ХарактеристикаНоменклатуры;
			Движение.Участок=ТСтрока.Участок;
			Движение.Операция=ТСтрока.Операция;
			Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.ВРаботе;
			Движение.ФайлСхемыРезки = Движение.ФайлСхемыРезки;
			Движение.Количество=ТСтрока.КратностьВРаботе; //Сколько листов в пачке
		КонецЕсли;
	КонецЦикла;	
	Для Каждого ТСтрока Из ТЗ_Взять Цикл     // Сменные задания
		Если ТСтрока.Кратность>0  Тогда
			Отбор = Новый Структура ("КлючПартии, Операция", ТСтрока.КлючВзять, ТСтрока.Операция);
			СменныеЗадания_Остатки = РегистрыНакопления.БЗ_СменныеЗадания.Остатки(ТСтрока.ВремяОперации, Отбор, ,"Количество");
			КоличествоЗавершено = ТСтрока.Кратность;
			Для Каждого СтрокаОстатка из СменныеЗадания_Остатки Цикл
				Если КоличествоЗавершено <=0 Тогда
					Прервать;
				КонецЕсли;
				МожноСписать = Макс (Мин(СтрокаОстатка.Количество, КоличествоЗавершено),0);
				Если МожноСписать>0 Тогда
					Движение=БЗ_СменныеЗадания.Добавить();
					Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
					Движение.Период=ТСтрока.ВремяОперации;
					Движение.Активность=Истина;		
					ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
					Движение.КлючПартии=ТСтрока.КлючСхемы;
					//Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.План;
					Движение.Количество= КоличествоЗавершено; //Сколько листов в пачке за операцию
					КоличествоЗавершено = КоличествоЗавершено - МожноСписать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ПоложитьРезка()
	БЗ_ОперацияРезка_Изделия = Движения.БЗ_ОперацияРезка_Изделия;
	БЗ_ОперацияРезка_Изделия.Записывать = Истина;
	
	БЗ_ОстаткиНаУчастках = Движения.БЗ_ОстаткиНаУчастках;
	БЗ_ОстаткиНаУчастках.Записывать = Истина;	
	
	ТЗ_Положить = ПолучитьСводнуюТЗПоложитьРезка();
	
	Для Каждого ТСтрока Из ТЗ_Положить Цикл
		Если ТСтрока.Количество>0  Тогда
			Отбор = Новый Структура ("КлючСхемы, КлючИзделия, Операция, Статус", ТСтрока.КлючВзять, ТСтрока.КлючПоложить, ТСтрока.Операция, Перечисления.БЗ_СтатусыОстатковНаУчастке.План);
			Резка_Изделия_Остатки = РегистрыНакопления.БЗ_ОперацияРезка_Изделия.Остатки(ТСтрока.ВремяОперации, Отбор, ,"Количество");
			КоличествоЗавершено = ТСтрока.Количество;
			Для Каждого СтрокаОстатка из Резка_Изделия_Остатки Цикл
				Если КоличествоЗавершено <=0 Тогда
					Прервать;
				КонецЕсли;
				МожноСписать = Макс (Мин(СтрокаОстатка.Количество, КоличествоЗавершено),0);
				//Резка
				Движение=БЗ_ОперацияРезка_Изделия.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
				Движение.Активность=Истина;
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Период=ТСтрока.ВремяОперации;
				Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.План;
				КоличествоЗавершено = КоличествоЗавершено - МожноСписать;
			КонецЦикла;
		КонецЕсли;	
		Если ТСтрока.КоличествоВРаботе>0  Тогда
			//В работе
			Движение=БЗ_ОперацияРезка_Изделия.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Приход;		
			Движение.Активность=Истина;		
			Движение.Период=Дата;
			Движение.КлючИзделия=ТСтрока.КлючПоложить;	
			Движение.КлючСхемы=ТСтрока.КлючСхемы;	
			Движение.Номенклатура= ТСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры= ТСтрока.ХарактеристикаНоменклатуры;
			Движение.Участок=ТСтрока.Участок;
			Движение.Операция=ТСтрока.Операция;
			Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.ВРаботе;
			Движение.Количество=ТСтрока.КоличествоВРаботе; //Сколько листов в пачке

		КонецЕсли;
		Если ТСтрока.КоличествоЗавершен>0  Тогда
			//Остатки
			Движение=БЗ_ОстаткиНаУчастках.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
			Движение.Период=ТСтрока.ВремяОперации;
			Движение.Активность=Истина;
			Движение.КлючСхемы=ТСтрока.КлючВзять;
			Движение.КлючИзделия=ТСтрока.КлючПоложить;
			Движение.Участок=ТСтрока.Участок;
			Движение.РабочееМесто=ТСтрока.РабочееМесто;
			Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.Завершен;
			ЗаполнитьЗначенияСвойств(Движение,ТСтрока);			
			Движение.Количество=ТСтрока.КоличествоЗавершен;

		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

Процедура Взять()
	БЗ_ОстаткиНаУчастках = Движения.БЗ_ОстаткиНаУчастках;
	БЗ_ОстаткиНаУчастках.Записывать = Истина;	
	
	Для Каждого ТСтрока Из ТСД_Взять Цикл
		Если ТСтрока.ТипДвиженияТСД<>Справочники.БЗ_ТипыДвижений_ТСД.ВРаботе Тогда
			//Остатки
			Движение=БЗ_ОстаткиНаУчастках.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Период=ТСтрока.ВремяОперации;
			Движение.Активность=Истина;
			Движение.КлючСхемы=ТСтрока.КлючВзять;
			Движение.КлючИзделия=ТСтрока.КлючПоложить;
			Движение.Статус=ТСтрока.ТипДвиженияТСД.СтатусОстатка;
			ЗаполнитьЗначенияСвойств(Движение,ТСтрока);			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Положить()
	БЗ_ОстаткиНаУчастках = Движения.БЗ_ОстаткиНаУчастках;
	БЗ_ОстаткиНаУчастках.Записывать = Истина;	
	
	Для Каждого ТСтрока Из ТСД_Положить Цикл
		Если ТСтрока.ТипДвиженияТСД<>Справочники.БЗ_ТипыДвижений_ТСД.ВРаботе Тогда
			//Остатки
			Движение=БЗ_ОстаткиНаУчастках.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
			Движение.Период=ТСтрока.ВремяОперации;
			Движение.Активность=Истина;
			Движение.КлючИзделия=ТСтрока.КлючПоложить;
			Движение.Статус=ТСтрока.ТипДвиженияТСД.СтатусОстатка;
			ЗаполнитьЗначенияСвойств(Движение,ТСтрока);			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Функция ПолучитьСводнуюТЗВзятьРезка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Взять.НомерСтроки КАК НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.КлючВзять КАК КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.КлючПоложить КАК КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Номенклатура КАК Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Количество КАК Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Кратность КАК Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Операция КАК Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ВремяОперации КАК ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Участок КАК Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.РабочееМесто КАК РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ТСД_Взять
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Взять КАК БЗ_ТехнологическаяОперацияТСД_Взять
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_Взять.Номенклатура КАК Номенклатура,
	|	ТСД_Взять.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ТСД_Взять.Количество) КАК Количество,
	|	ТСД_Взять.Операция КАК Операция,
	|	ТСД_Взять.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	МИНИМУМ(ТСД_Взять.ВремяОперации) КАК ВремяОперации,
	|	ТСД_Взять.Участок КАК Участок,
	|	ТСД_Взять.РабочееМесто КАК РабочееМесто,
	|	ТСД_Взять.Сотрудник КАК Сотрудник,
	|	ТСД_Взять.КлючВзять КАК КлючВзять,
	|	СУММА(ТСД_Взять.Кратность) КАК Кратность
	|ПОМЕСТИТЬ ТСД_ПоложитьСводно
	|ИЗ
	|	ТСД_Взять КАК ТСД_Взять
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_Взять.Номенклатура,
	|	ТСД_Взять.ХарактеристикаНоменклатуры,
	|	ТСД_Взять.ТипДвиженияТСД,
	|	ТСД_Взять.Операция,
	|	ТСД_Взять.Участок,
	|	ТСД_Взять.РабочееМесто,
	|	ТСД_Взять.Сотрудник,
	|	ТСД_Взять.КлючВзять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_ВзятьСводно.Операция КАК Операция,
	|	ТСД_ВзятьСводно.Участок КАК Участок,
	|	1 КАК Приоритет,
	|	СУММА(ТСД_ВзятьСводно.Количество) КАК КоличествоВРаботе,
	|	0 КАК КоличествоЗавершен,
	|	0 КАК КоличествоПрочие,
	|	ТСД_ВзятьСводно.ВремяОперации КАК ВремяОперации,
	|	ТСД_ВзятьСводно.РабочееМесто КАК РабочееМесто,
	|	ТСД_ВзятьСводно.Сотрудник КАК Сотрудник,
	|	ТСД_ВзятьСводно.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	ТСД_ВзятьСводно.Номенклатура КАК Номенклатура,
	|	ТСД_ВзятьСводно.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТСД_ВзятьСводно.КлючВзять КАК КлючВзять,
	|	СУММА(ТСД_ВзятьСводно.Кратность) КАК КратностьВРаботе,
	|	0 КАК КратностьЗавершен,
	|	0 КАК КратностьПрочие
	|ПОМЕСТИТЬ Положить_Операции
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ВзятьСводно
	|ГДЕ
	|	ТСД_ВзятьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ВзятьСводно.Операция,
	|	ТСД_ВзятьСводно.ВремяОперации,
	|	ТСД_ВзятьСводно.Участок,
	|	ТСД_ВзятьСводно.РабочееМесто,
	|	ТСД_ВзятьСводно.Сотрудник,
	|	ТСД_ВзятьСводно.ТипДвиженияТСД,
	|	ТСД_ВзятьСводно.Номенклатура,
	|	ТСД_ВзятьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ВзятьСводно.КлючВзять
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ВзятьСводно.Операция,
	|	ТСД_ВзятьСводно.Участок,
	|	2,
	|	СУММА(-ТСД_ВзятьСводно.Количество),
	|	СУММА(ТСД_ВзятьСводно.Количество),
	|	0,
	|	ТСД_ВзятьСводно.ВремяОперации,
	|	ТСД_ВзятьСводно.РабочееМесто,
	|	ТСД_ВзятьСводно.Сотрудник,
	|	ТСД_ВзятьСводно.ТипДвиженияТСД,
	|	ТСД_ВзятьСводно.Номенклатура,
	|	ТСД_ВзятьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ВзятьСводно.КлючВзять,
	|	-ТСД_ВзятьСводно.Кратность,
	|	СУММА(ТСД_ВзятьСводно.Кратность),
	|	0
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ВзятьСводно
	|ГДЕ
	|	ТСД_ВзятьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ВзятьСводно.Операция,
	|	ТСД_ВзятьСводно.ВремяОперации,
	|	ТСД_ВзятьСводно.Участок,
	|	ТСД_ВзятьСводно.РабочееМесто,
	|	ТСД_ВзятьСводно.Сотрудник,
	|	ТСД_ВзятьСводно.ТипДвиженияТСД,
	|	ТСД_ВзятьСводно.Номенклатура,
	|	ТСД_ВзятьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ВзятьСводно.КлючВзять,
	|	-ТСД_ВзятьСводно.Кратность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ВзятьСводно.Операция,
	|	ТСД_ВзятьСводно.Участок,
	|	0,
	|	СУММА(-ТСД_ВзятьСводно.Количество),
	|	0,
	|	СУММА(ТСД_ВзятьСводно.Количество),
	|	ТСД_ВзятьСводно.ВремяОперации,
	|	ТСД_ВзятьСводно.РабочееМесто,
	|	ТСД_ВзятьСводно.Сотрудник,
	|	ТСД_ВзятьСводно.ТипДвиженияТСД,
	|	ТСД_ВзятьСводно.Номенклатура,
	|	ТСД_ВзятьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ВзятьСводно.КлючВзять,
	|	-ТСД_ВзятьСводно.Кратность,
	|	0,
	|	СУММА(ТСД_ВзятьСводно.Кратность)
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ВзятьСводно
	|ГДЕ
	|	ТСД_ВзятьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|	И ТСД_ВзятьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ВзятьСводно.Операция,
	|	ТСД_ВзятьСводно.ВремяОперации,
	|	ТСД_ВзятьСводно.Участок,
	|	ТСД_ВзятьСводно.РабочееМесто,
	|	ТСД_ВзятьСводно.Сотрудник,
	|	ТСД_ВзятьСводно.ТипДвиженияТСД,
	|	ТСД_ВзятьСводно.Номенклатура,
	|	ТСД_ВзятьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ВзятьСводно.КлючВзять,
	|	-ТСД_ВзятьСводно.Кратность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взять_Операции.КлючВзять КАК КлючВзять,
	|	Взять_Операции.Операция КАК Операция,
	|	МАКСИМУМ(Взять_Операции.Приоритет) КАК Приоритет,
	|	СУММА(Взять_Операции.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(Взять_Операции.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(Взять_Операции.КоличествоПрочие) КАК КоличествоПрочие,
	|	МИНИМУМ(Взять_Операции.ВремяОперации) КАК ВремяОперации,
	|	Взять_Операции.Участок КАК Участок,
	|	Взять_Операции.РабочееМесто КАК РабочееМесто,
	|	Взять_Операции.Сотрудник КАК Сотрудник,
	|	Взять_Операции.Номенклатура КАК Номенклатура,
	|	Взять_Операции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Взять_Операции.КратностьВРаботе) КАК КратностьВРаботе,
	|	СУММА(Взять_Операции.КратностьЗавершен) КАК КратностьЗавершен,
	|	СУММА(Взять_Операции.КратностьПрочие) КАК КратностьПрочие
	|ПОМЕСТИТЬ ВзятьСводно
	|ИЗ
	|	Положить_Операции КАК Взять_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	Взять_Операции.Операция,
	|	Взять_Операции.Участок,
	|	Взять_Операции.РабочееМесто,
	|	Взять_Операции.Сотрудник,
	|	Взять_Операции.Номенклатура,
	|	Взять_Операции.ХарактеристикаНоменклатуры,
	|	Взять_Операции.КлючВзять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взять_Операции.КлючВзять КАК КлючСхемы,
	|	Взять_Операции.КлючВзять КАК КлючВзять,
	|	Взять_Операции.Операция КАК Операция,
	|	СУММА(ВзятьСводно.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(ВзятьСводно.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(ВзятьСводно.КоличествоПрочие) КАК КоличествоПрочие,
	|	СУММА(ВзятьСводно.КоличествоВРаботе) КАК ОстатокВРаботе,
	|	СУММА(ВзятьСводно.КоличествоЗавершен) КАК ОстатокЗавершен,
	|	СУММА(ВзятьСводно.КоличествоПрочие) КАК ОстатокПрочие,
	|	ВзятьСводно.ВремяОперации КАК ВремяОперации,
	|	Взять_Операции.Участок КАК Участок,
	|	Взять_Операции.РабочееМесто КАК РабочееМесто,
	|	Взять_Операции.Сотрудник КАК Сотрудник,
	|	Взять_Операции.Номенклатура КАК Номенклатура,
	|	Взять_Операции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Взять_Операции.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	Взять_Операции.ТипДвиженияТСД.СтатусОстатка КАК Статус,
	|	&Ссылка КАК Регистратор,
	|	СУММА(ВзятьСводно.КратностьВРаботе) КАК КратностьВРаботе,
	|	СУММА(ВзятьСводно.КратностьЗавершен) КАК КратностьЗавершен,
	|	СУММА(ВзятьСводно.КратностьПрочие) КАК КратностьПрочие,
	|	СУММА(ВзятьСводно.КоличествоВРаботе + ВзятьСводно.КоличествоЗавершен) КАК Количество,
	|	СУММА(ВзятьСводно.КратностьВРаботе + ВзятьСводно.КратностьЗавершен) КАК Кратность
	|ИЗ
	|	Положить_Операции КАК Взять_Операции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВзятьСводно КАК ВзятьСводно
	|		ПО Взять_Операции.Операция = ВзятьСводно.Операция
	|			И Взять_Операции.Приоритет = ВзятьСводно.Приоритет
	|			И Взять_Операции.Участок = ВзятьСводно.Участок
	|			И Взять_Операции.РабочееМесто = ВзятьСводно.РабочееМесто
	|			И Взять_Операции.Сотрудник = ВзятьСводно.Сотрудник
	|			И Взять_Операции.КлючВзять = ВзятьСводно.КлючВзять
	|ГДЕ
	|	(Взять_Операции.КоличествоВРаботе <> 0
	|			ИЛИ Взять_Операции.КоличествоЗавершен <> 0
	|			ИЛИ Взять_Операции.КоличествоПрочие <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Взять_Операции.Участок,
	|	Взять_Операции.Сотрудник,
	|	Взять_Операции.Операция,
	|	Взять_Операции.РабочееМесто,
	|	Взять_Операции.Номенклатура,
	|	Взять_Операции.ХарактеристикаНоменклатуры,
	|	ВзятьСводно.ВремяОперации,
	|	Взять_Операции.ТипДвиженияТСД,
	|	Взять_Операции.ТипДвиженияТСД.СтатусОстатка,
	|	Взять_Операции.КлючВзять,
	|	Взять_Операции.КлючВзять";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	ТЗ_ТСД_Операции = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ_ТСД_Операции;
КонецФункции


Функция ПолучитьСводнуюТЗПоложитьРезка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.НомерСтроки КАК НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючВзять КАК КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючПоложить КАК КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Номенклатура КАК Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Количество КАК Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Кратность КАК Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Операция КАК Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ВремяОперации КАК ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Участок КАК Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.РабочееМесто КАК РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ТСД_Положить
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Положить КАК БЗ_ТехнологическаяОперацияТСД_Положить
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_Положить.Номенклатура КАК Номенклатура,
	|	ТСД_Положить.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ТСД_Положить.Количество) КАК Количество,
	|	ТСД_Положить.Операция КАК Операция,
	|	ТСД_Положить.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	МИНИМУМ(ТСД_Положить.ВремяОперации) КАК ВремяОперации,
	|	ТСД_Положить.Участок КАК Участок,
	|	ТСД_Положить.РабочееМесто КАК РабочееМесто,
	|	ТСД_Положить.Сотрудник КАК Сотрудник,
	|	ТСД_Положить.КлючПоложить КАК КлючПоложить,
	|	СУММА(ТСД_Положить.Кратность) КАК Кратность,
	|	ТСД_Положить.КлючВзять
	|ПОМЕСТИТЬ ТСД_ПоложитьСводно
	|ИЗ
	|	ТСД_Положить КАК ТСД_Положить
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	ТСД_Положить.Операция,
	|	ТСД_Положить.Участок,
	|	ТСД_Положить.РабочееМесто,
	|	ТСД_Положить.Сотрудник,
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.КлючВзять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.Операция КАК Операция,
	|	ТСД_ПоложитьСводно.Участок КАК Участок,
	|	1 КАК Приоритет,
	|	СУММА(ТСД_ПоложитьСводно.Количество) КАК КоличествоВРаботе,
	|	0 КАК КоличествоЗавершен,
	|	0 КАК КоличествоПрочие,
	|	ТСД_ПоложитьСводно.ВремяОперации КАК ВремяОперации,
	|	ТСД_ПоложитьСводно.РабочееМесто КАК РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник КАК Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура КАК Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.КлючПоложить КАК КлючПоложить,
	|	СУММА(ТСД_ПоложитьСводно.Кратность) КАК КратностьВРаботе,
	|	0 КАК КратностьЗавершен,
	|	0 КАК КратностьПрочие,
	|	ТСД_ПоложитьСводно.КлючВзять
	|ПОМЕСТИТЬ Положить_Операции
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.КлючВзять,
	|	ТСД_ПоложитьСводно.ВремяОперации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.Участок,
	|	2,
	|	СУММА(-ТСД_ПоложитьСводно.Количество),
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	0,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	СУММА(-ТСД_ПоложитьСводно.Кратность),
	|	СУММА(ТСД_ПоложитьСводно.Кратность),
	|	0,
	|	ТСД_ПоложитьСводно.КлючВзять
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.КлючВзять
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.Участок,
	|	0,
	|	СУММА(-ТСД_ПоложитьСводно.Количество),
	|	0,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	СУММА(-ТСД_ПоложитьСводно.Кратность),
	|	0,
	|	СУММА(ТСД_ПоложитьСводно.Кратность),
	|	ТСД_ПоложитьСводно.КлючВзять
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|	И ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.КлючВзять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить КАК КлючПоложить,
	|	Положить_Операции.Операция КАК Операция,
	|	МАКСИМУМ(Положить_Операции.Приоритет) КАК Приоритет,
	|	СУММА(Положить_Операции.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(Положить_Операции.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(Положить_Операции.КоличествоПрочие) КАК КоличествоПрочие,
	|	МИНИМУМ(Положить_Операции.ВремяОперации) КАК ВремяОперации,
	|	Положить_Операции.Участок КАК Участок,
	|	Положить_Операции.РабочееМесто КАК РабочееМесто,
	|	Положить_Операции.Сотрудник КАК Сотрудник,
	|	Положить_Операции.Номенклатура КАК Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Положить_Операции.КратностьВРаботе) КАК КратностьВРаботе,
	|	СУММА(Положить_Операции.КратностьЗавершен) КАК КратностьЗавершен,
	|	СУММА(Положить_Операции.КратностьПрочие) КАК КратностьПрочие,
	|	Положить_Операции.КлючВзять
	|ПОМЕСТИТЬ ПоложитьСводно
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.Операция,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.КлючВзять
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючВзять КАК КлючСхемы,
	|	Положить_Операции.КлючПоложить КАК КлючПоложить,
	|	Положить_Операции.Операция КАК Операция,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК КоличествоПрочие,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК ОстатокВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК ОстатокЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК ОстатокПрочие,
	|	ПоложитьСводно.ВремяОперации КАК ВремяОперации,
	|	Положить_Операции.Участок КАК Участок,
	|	Положить_Операции.РабочееМесто КАК РабочееМесто,
	|	Положить_Операции.Сотрудник КАК Сотрудник,
	|	Положить_Операции.Номенклатура КАК Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Положить_Операции.ТипДвиженияТСД КАК ТипДвиженияТСД,
	|	Положить_Операции.ТипДвиженияТСД.СтатусОстатка КАК Статус,
	|	&Ссылка КАК Регистратор,
	|	СУММА(ПоложитьСводно.КратностьВРаботе) КАК КратностьВРаботе,
	|	СУММА(ПоложитьСводно.КратностьЗавершен) КАК КратностьЗавершен,
	|	СУММА(ПоложитьСводно.КратностьПрочие) КАК КратностьПрочие,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе + ПоложитьСводно.КоличествоЗавершен) КАК Количество,
	|	СУММА(ПоложитьСводно.КратностьВРаботе + ПоложитьСводно.КратностьЗавершен) КАК Кратность,
	|	Положить_Операции.КлючВзять
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоложитьСводно КАК ПоложитьСводно
	|		ПО Положить_Операции.Операция = ПоложитьСводно.Операция
	|			И Положить_Операции.Приоритет = ПоложитьСводно.Приоритет
	|			И Положить_Операции.Участок = ПоложитьСводно.Участок
	|			И Положить_Операции.РабочееМесто = ПоложитьСводно.РабочееМесто
	|			И Положить_Операции.Сотрудник = ПоложитьСводно.Сотрудник
	|			И Положить_Операции.КлючПоложить = ПоложитьСводно.КлючПоложить
	|			И Положить_Операции.КлючВзять = ПоложитьСводно.КлючВзять
	|ГДЕ
	|	(Положить_Операции.КоличествоВРаботе <> 0
	|			ИЛИ Положить_Операции.КоличествоЗавершен <> 0
	|			ИЛИ Положить_Операции.КоличествоПрочие <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.Участок,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Операция,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.ТипДвиженияТСД,
	|	Положить_Операции.ТипДвиженияТСД.СтатусОстатка,
	|	Положить_Операции.КлючВзять,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.КлючВзять";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	ТЗ_ТСД_Операции = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ_ТСД_Операции;
КонецФункции


Функция ПолучитьСводнуюТЗВыполненыхОперацийРезка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Сотрудник
	|ПОМЕСТИТЬ ТСД_Положить
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Положить КАК БЗ_ТехнологическаяОперацияТСД_Положить
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	СУММА(ТСД_Положить.Количество) КАК Количество,
	|	ТСД_Положить.Операция,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	МИНИМУМ(ТСД_Положить.ВремяОперации) КАК ВремяОперации,
	|	ТСД_Положить.Участок,
	|	ТСД_Положить.РабочееМесто,
	|	ТСД_Положить.Сотрудник
	|ПОМЕСТИТЬ ТСД_ПоложитьСводно
	|ИЗ
	|	ТСД_Положить КАК ТСД_Положить
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	ТСД_Положить.Операция,
	|	ТСД_Положить.Участок,
	|	ТСД_Положить.РабочееМесто,
	|	ТСД_Положить.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	СУММА(ТСД_ПоложитьСводно.Количество) КАК КоличествоВРаботе,
	|	ТСД_ПоложитьСводно.Операция,
	|	1 КАК Приоритет,
	|	0 КАК КоличествоЗавершен,
	|	0 КАК КоличествоПрочие,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ Положить_Операции
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.Операция,
	|	2,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	0,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.Операция,
	|	0,
	|	0,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|	И ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	МАКСИМУМ(Положить_Операции.Приоритет) КАК Приоритет,
	|	СУММА(Положить_Операции.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(Положить_Операции.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(Положить_Операции.КоличествоПрочие) КАК КоличествоПрочие,
	|	МИНИМУМ(Положить_Операции.ВремяОперации) КАК ВремяОперации,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ПоложитьСводно
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить КАК КлючИзделия,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК КоличествоПрочие,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК ОстатокВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК ОстатокЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК ОстатокПрочие,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	Положить_Операции.ТипДвиженияТСД,
	|	Положить_Операции.ТипДвиженияТСД.СтатусОстатка КАК Статус,
	|	&Ссылка КАК Регистратор
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоложитьСводно КАК ПоложитьСводно
	|		ПО Положить_Операции.КлючПоложить = ПоложитьСводно.КлючПоложить
	|			И Положить_Операции.Операция = ПоложитьСводно.Операция
	|			И Положить_Операции.Приоритет = ПоложитьСводно.Приоритет
	|			И Положить_Операции.Участок = ПоложитьСводно.Участок
	|			И Положить_Операции.РабочееМесто = ПоложитьСводно.РабочееМесто
	|			И Положить_Операции.Сотрудник = ПоложитьСводно.Сотрудник
	|ГДЕ
	|	(Положить_Операции.КоличествоВРаботе <> 0
	|			ИЛИ Положить_Операции.КоличествоЗавершен <> 0
	|			ИЛИ Положить_Операции.КоличествоПрочие <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Участок,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Операция,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.ТипДвиженияТСД,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.ТипДвиженияТСД.СтатусОстатка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	ТЗ_ТСД_Операции = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ_ТСД_Операции;
КонецФункции

Функция ПолучитьСводнуюТЗНЗПИ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Взять.НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Сотрудник,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Бригада
	|ПОМЕСТИТЬ ТСД_Взять
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Взять КАК БЗ_ТехнологическаяОперацияТСД_Взять
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Сотрудник,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Бригада
	|ПОМЕСТИТЬ ТСД_Положить
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Положить КАК БЗ_ТехнологическаяОперацияТСД_Положить
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	СУММА(ТСД_Положить.Количество) КАК Количество,
	|	ТСД_Положить.Операция,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	МИНИМУМ(ТСД_Положить.ВремяОперации) КАК ВремяОперации,
	|	ТСД_Взять.Участок,
	|	ТСД_Взять.РабочееМесто,
	|	ТСД_Взять.Сотрудник,
	|	ТСД_Взять.Бригада
	|ПОМЕСТИТЬ ТСД_ПоложитьСводно
	|ИЗ
	|	ТСД_Положить КАК ТСД_Положить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТСД_Взять КАК ТСД_Взять
	|		ПО ТСД_Положить.НомерСтроки = ТСД_Взять.НомерСтроки
	|ГДЕ
	|	(ТСД_Положить.Операция <> ТСД_Взять.Операция
	|			ИЛИ ТСД_Положить.ТипДвиженияТСД <> ТСД_Взять.ТипДвиженияТСД)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	ТСД_Положить.Операция,
	|	ТСД_Взять.Участок,
	|	ТСД_Взять.РабочееМесто,
	|	ТСД_Взять.Сотрудник,
	|	ТСД_Взять.Бригада
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	СУММА(ТСД_ПоложитьСводно.Количество) КАК КоличествоВРаботе,
	|	ТСД_ПоложитьСводно.Операция,
	|	1 КАК Приоритет,
	|	0 КАК КоличествоЗавершен,
	|	0 КАК КоличествоПрочие,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ Положить_Операции
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.Операция,
	|	2,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	0,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	0,
	|	ТСД_ПоложитьСводно.Операция,
	|	0,
	|	-ТСД_ПоложитьСводно.Количество,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|	И ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	-ТСД_ПоложитьСводно.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	МАКСИМУМ(Положить_Операции.Приоритет) КАК Приоритет,
	|	СУММА(Положить_Операции.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(Положить_Операции.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(Положить_Операции.КоличествоПрочие) КАК КоличествоПрочие,
	|	МИНИМУМ(Положить_Операции.ВремяОперации) КАК ВремяОперации,
	|	Положить_Операции.Участок,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ПоложитьСводно
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	Положить_Операции.Участок,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить КАК КлючИзделия,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	СУММА(Положить_Операции.Приоритет) КАК Приоритет,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК КоличествоПрочие,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК ОстатокВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК ОстатокЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК ОстатокПрочие,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.Участок,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	&Ссылка КАК Регистратор
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоложитьСводно КАК ПоложитьСводно
	|		ПО Положить_Операции.КлючПоложить = ПоложитьСводно.КлючПоложить
	|			И Положить_Операции.Операция = ПоложитьСводно.Операция
	|			И Положить_Операции.Приоритет = ПоложитьСводно.Приоритет
	|			И Положить_Операции.Участок = ПоложитьСводно.Участок
	|ГДЕ
	|	(Положить_Операции.КоличествоВРаботе <> 0
	|			ИЛИ Положить_Операции.КоличествоЗавершен <> 0
	|			ИЛИ Положить_Операции.КоличествоПрочие <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.Операция,
	|	Положить_Операции.Участок,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.КлючПоложить";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	ТЗ_ТСД_Операции = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ_ТСД_Операции;
КонецФункции

Функция ПолучитьСводнуюТЗВыполненыхОпераций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 

	"ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Взять.НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Сотрудник,
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Бригада
	|ПОМЕСТИТЬ ТСД_Взять
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Взять КАК БЗ_ТехнологическаяОперацияТСД_Взять
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Взять.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.НомерСтроки,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючВзять,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.КлючПоложить,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Номенклатура,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ХарактеристикаНоменклатуры,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Количество,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Кратность,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Операция,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Сотрудник,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ВремяОперации,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.ТипДвиженияТСД,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Участок,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.РабочееМесто,
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Бригада
	|ПОМЕСТИТЬ ТСД_Положить
	|ИЗ
	|	Документ.БЗ_ТехнологическаяОперация.ТСД_Положить КАК БЗ_ТехнологическаяОперацияТСД_Положить
	|ГДЕ
	|	БЗ_ТехнологическаяОперацияТСД_Положить.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	СУММА(ТСД_Положить.Количество) КАК Количество,
	|	ТСД_Положить.Операция,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	МИНИМУМ(ТСД_Положить.ВремяОперации) КАК ВремяОперации,
	|	ТСД_Взять.Участок,
	|	ТСД_Взять.РабочееМесто,
	|	ТСД_Взять.Сотрудник,
	|	ТСД_Взять.Бригада
	|ПОМЕСТИТЬ ТСД_ПоложитьСводно
	|ИЗ
	|	ТСД_Положить КАК ТСД_Положить
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТСД_Взять КАК ТСД_Взять
	|		ПО ТСД_Положить.НомерСтроки = ТСД_Взять.НомерСтроки
	|ГДЕ
	|	(ТСД_Положить.Операция <> ТСД_Взять.Операция
	|			ИЛИ ТСД_Положить.ТипДвиженияТСД <> ТСД_Взять.ТипДвиженияТСД)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_Положить.Номенклатура,
	|	ТСД_Положить.КлючПоложить,
	|	ТСД_Положить.ХарактеристикаНоменклатуры,
	|	ТСД_Положить.ТипДвиженияТСД,
	|	ТСД_Положить.Операция,
	|	ТСД_Взять.Участок,
	|	ТСД_Взять.РабочееМесто,
	|	ТСД_Взять.Сотрудник,
	|	ТСД_Взять.Бригада
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	СУММА(ТСД_ПоложитьСводно.Количество) КАК КоличествоВРаботе,
	|	ТСД_ПоложитьСводно.Операция,
	|	1 КАК Приоритет,
	|	0 КАК КоличествоЗавершен,
	|	0 КАК КоличествоПрочие,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.Бригада
	|ПОМЕСТИТЬ Положить_Операции
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.Бригада
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.Операция,
	|	2,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	0,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.Бригада
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД = ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.Бригада
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.Операция,
	|	0,
	|	-ТСД_ПоложитьСводно.Количество,
	|	СУММА(ТСД_ПоложитьСводно.Количество),
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.Бригада
	|ИЗ
	|	ТСД_ПоложитьСводно КАК ТСД_ПоложитьСводно
	|ГДЕ
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.ВРаботе)
	|	И ТСД_ПоложитьСводно.ТипДвиженияТСД <> ЗНАЧЕНИЕ(Справочник.БЗ_ТипыДвижений_ТСД.Завершен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТСД_ПоложитьСводно.КлючПоложить,
	|	ТСД_ПоложитьСводно.Операция,
	|	-ТСД_ПоложитьСводно.Количество,
	|	ТСД_ПоложитьСводно.ВремяОперации,
	|	ТСД_ПоложитьСводно.Участок,
	|	ТСД_ПоложитьСводно.РабочееМесто,
	|	ТСД_ПоложитьСводно.Сотрудник,
	|	ТСД_ПоложитьСводно.ТипДвиженияТСД,
	|	ТСД_ПоложитьСводно.Номенклатура,
	|	ТСД_ПоложитьСводно.ХарактеристикаНоменклатуры,
	|	ТСД_ПоложитьСводно.Бригада,
	|	-ТСД_ПоложитьСводно.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	МАКСИМУМ(Положить_Операции.Приоритет) КАК Приоритет,
	|	СУММА(Положить_Операции.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(Положить_Операции.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(Положить_Операции.КоличествоПрочие) КАК КоличествоПрочие,
	|	МИНИМУМ(Положить_Операции.ВремяОперации) КАК ВремяОперации,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	Положить_Операции.Бригада
	|ПОМЕСТИТЬ ПоложитьСводно
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	Положить_Операции.Бригада
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Положить_Операции.КлючПоложить КАК КлючИзделия,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.Операция,
	|	СУММА(Положить_Операции.Приоритет) КАК Приоритет,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК КоличествоВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК КоличествоЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК КоличествоПрочие,
	|	СУММА(ПоложитьСводно.КоличествоВРаботе) КАК ОстатокВРаботе,
	|	СУММА(ПоложитьСводно.КоличествоЗавершен) КАК ОстатокЗавершен,
	|	СУММА(ПоложитьСводно.КоличествоПрочие) КАК ОстатокПрочие,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.Участок,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.ТипДвиженияТСД,
	|	Положить_Операции.ТипДвиженияТСД.СтатусОстатка КАК Статус,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	&Ссылка КАК Регистратор,
	|	Положить_Операции.Бригада
	|ИЗ
	|	Положить_Операции КАК Положить_Операции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоложитьСводно КАК ПоложитьСводно
	|		ПО Положить_Операции.КлючПоложить = ПоложитьСводно.КлючПоложить
	|			И Положить_Операции.Операция = ПоложитьСводно.Операция
	|			И Положить_Операции.Приоритет = ПоложитьСводно.Приоритет
	|			И Положить_Операции.Участок = ПоложитьСводно.Участок
	|			И Положить_Операции.РабочееМесто = ПоложитьСводно.РабочееМесто
	|			И Положить_Операции.Сотрудник = ПоложитьСводно.Сотрудник
	|ГДЕ
	|	(Положить_Операции.КоличествоВРаботе <> 0
	|			ИЛИ Положить_Операции.КоличествоЗавершен <> 0
	|			ИЛИ Положить_Операции.КоличествоПрочие <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Положить_Операции.Операция,
	|	Положить_Операции.РабочееМесто,
	|	Положить_Операции.Сотрудник,
	|	Положить_Операции.Участок,
	|	Положить_Операции.ТипДвиженияТСД,
	|	Положить_Операции.КлючПоложить,
	|	Положить_Операции.ТипДвиженияТСД.СтатусОстатка,
	|	Положить_Операции.Номенклатура,
	|	Положить_Операции.ХарактеристикаНоменклатуры,
	|	ПоложитьСводно.ВремяОперации,
	|	Положить_Операции.Бригада,
	|	Положить_Операции.КлючПоложить";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	ТЗ_ТСД_Операции = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ_ТСД_Операции;
КонецФункции

Процедура Движение_НЗПИ(ТЗ_Сводная_ТСД_Операции)
	//Незавершенное производство
	
	Если ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.РезкаЗапуск
		 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.РезкаСнятие
		 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.Обработка 
		 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.Корректировка Тогда
		Возврат;
	КонецЕсли;
	
	//Очистка движений
	БЗ_НезавершенноеПроизводство_Изделия = Движения.БЗ_НезавершенноеПроизводство_Изделия;
	БЗ_НезавершенноеПроизводство_Изделия.Очистить();
	БЗ_НезавершенноеПроизводство_Изделия.Записывать = Истина;
	
	Для Каждого ТСтрока Из ТЗ_Сводная_ТСД_Операции Цикл
		Отбор = Новый Структура ("КлючИзделия, Операция", ТСтрока.КлючПоложить, ТСтрока.Операция);
		НЗПИ_Остатки = РегистрыНакопления.БЗ_НезавершенноеПроизводство_Изделия.Остатки(ТСтрока.ВремяОперации, Отбор, ,"Количество");
		Для Каждого СтрокаОстатка из НЗПИ_Остатки Цикл
			//НЗПИ Создан -> В Работе
			Если ТСтрока.КоличествоВРаботе>0 И СтрокаОстатка.Статус = Перечисления.БЗ_СтатусыОстатковНаУчастке.План Тогда
				МожноСписать = Макс (Мин(СтрокаОстатка.Количество, ТСтрока.ОстатокВРаботе),0);
				Движение=БЗ_НезавершенноеПроизводство_Изделия.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
				Движение.Активность=Истина;
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Количество = МожноСписать;
				Движение.Период=ТСтрока.ВремяОперации;
				
				Движение=БЗ_НезавершенноеПроизводство_Изделия.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
				Движение.Активность=Истина;
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Количество = МожноСписать;
				Движение.Период=ТСтрока.ВремяОперации;
				Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.ВРаботе;
				ТСтрока.ОстатокВРаботе = ТСтрока.ОстатокВРаботе - МожноСписать;
			КонецЕсли;
			//НЗПИ Создан, В Работе -> Завершен
			Если ТСтрока.КоличествоЗавершен>0  
				И (СтрокаОстатка.Статус = Перечисления.БЗ_СтатусыОстатковНаУчастке.План
					ИЛИ СтрокаОстатка.Статус = Перечисления.БЗ_СтатусыОстатковНаУчастке.ВРаботе) Тогда
				МожноСписать = Макс (Мин(СтрокаОстатка.Количество, ТСтрока.ОстатокЗавершен),0);
				Движение=БЗ_НезавершенноеПроизводство_Изделия.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
				Движение.Активность=Истина;
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Количество = МожноСписать;
				Движение.Период=ТСтрока.ВремяОперации;
				
				Движение=БЗ_НезавершенноеПроизводство_Изделия.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
				Движение.Активность=Истина;
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Количество = МожноСписать;
				Движение.Период=ТСтрока.ВремяОперации;
				Движение.Статус=Перечисления.БЗ_СтатусыОстатковНаУчастке.Завершен;
				ТСтрока.ОстатокЗавершен = ТСтрока.ОстатокЗавершен - МожноСписать;
			КонецЕсли;
			//НЗПИ Создан, В Работе -> Прекращение цепочки: брак или недостача
			Если ТСтрока.КоличествоПрочие>0 
				И (СтрокаОстатка.Статус = Перечисления.БЗ_СтатусыОстатковНаУчастке.План
					ИЛИ СтрокаОстатка.Статус = Перечисления.БЗ_СтатусыОстатковНаУчастке.ВРаботе) Тогда
				МожноСписать = Макс (Мин(СтрокаОстатка.Количество, ТСтрока.ОстатокПрочие),0);
				Движение=БЗ_НезавершенноеПроизводство_Изделия.Добавить();
				Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
				Движение.Активность=Истина;
				ЗаполнитьЗначенияСвойств(Движение,СтрокаОстатка);			
				Движение.Количество = МожноСписать;
				Движение.Период=ТСтрока.ВремяОперации;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	БЗ_НезавершенноеПроизводство_Изделия.Записать();
КонецПроцедуры

Процедура Движение_ВыполненныеОперации(ТЗ_Сводная_ТСД_Операции)
	//Выполненные операции
	
	Если ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.РезкаЗапуск
		 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.РезкаСнятие
		 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.Обработка 
		 //И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.Корректировка 
		 Тогда
		Возврат;
	КонецЕсли;
	
	//Очистка движений
	БЗ_ВыполненныеОперации = Движения.БЗ_ВыполненныеОперации;
	БЗ_ВыполненныеОперации.Очистить();
	БЗ_ВыполненныеОперации.Записывать = Истина;
	
	Для Каждого ТСтрока Из ТЗ_Сводная_ТСД_Операции Цикл
		ЗавершеноПоФакту = ТСтрока.КоличествоЗавершен + ТСтрока.КоличествоПрочие;
		ЗавершеноПоПлану = ТСтрока.КоличествоЗавершен - ТСтрока.ОстатокЗавершен;
		Если ЗавершеноПоФакту <> 0 Или ЗавершеноПоПлану <> 0 Тогда 
			Движение=БЗ_ВыполненныеОперации.Добавить();
			Движение.Активность=Истина;
			ЗаполнитьЗначенияСвойств(Движение,ТСтрока);			
			Движение.Количество = ЗавершеноПоФакту;
			Движение.КоличествоПоПлану = ЗавершеноПоПлану;
			Движение.Период=ТСтрока.ВремяОперации;
		КонецЕсли;
	КонецЦикла;	
	БЗ_ВыполненныеОперации.Записать();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Статус=Перечисления.БЗ_СтатусыТехнологическихОпераций.Отменен Тогда
		ОбработкаУдаленияПроведения(Отказ);
		Возврат;
	КонецЕсли;
	Если ВидОперации=Перечисления.БЗ_ВидТехнологическойОперации.РезкаЗапуск Тогда
		ВзятьРезка();
		ПоложитьРезка();
		ТЗ_Сводная_ТСД_Операции = ПолучитьСводнуюТЗВыполненыхОперацийРезка();
		Движение_НЗПИ(ТЗ_Сводная_ТСД_Операции);
		Движение_ВыполненныеОперации(ТЗ_Сводная_ТСД_Операции);
	Иначе
		Взять();
		Положить();
		Если  ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.РезкаСнятие
			 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.Обработка 
			 И ВидОперации<>Перечисления.БЗ_ВидТехнологическойОперации.Корректировка Тогда
			Возврат;
		КонецЕсли;
		ТЗ_Сводная_ТСД_НЗПИ = ПолучитьСводнуюТЗНЗПИ();
		Движение_НЗПИ(ТЗ_Сводная_ТСД_НЗПИ);
		ТЗ_Сводная_ТСД_Операции = ПолучитьСводнуюТЗВыполненыхОпераций();
		Движение_ВыполненныеОперации(ТЗ_Сводная_ТСД_Операции);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.БЗ_НезавершенноеПроизводство_Изделия.Очистить();
	Движения.БЗ_ОперацияРезка_Изделия.Очистить();
	Движения.БЗ_ОперацияРезка_Материалы.Очистить();
	Движения.БЗ_ОстаткиНаУчастках.Очистить();
	Движения.БЗ_ВыполненныеОперации.Очистить();
	Движения.Записать();
	
КонецПроцедуры
